{
  "architectures": [
    "LlamaForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 100257,
  "end_token_id": 100257,
  "eos_token_id": 100257,
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 2048,
  "initializer_range": 0.02,
  "intermediate_size": 7168,
  "max_position_embeddings": 131072,
  "mlp_bias": false,
  "model_type": "llama",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "num_key_value_heads": 8,
  "pad_token_id": 100257,
  "pretraining_tp": 1,
  "resid_pdrop": 0.2,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "rope_theta": 100000000,
  "tie_word_embeddings": true,
  "torch_dtype": "float32",
  "transformers_version": "4.51.3",
  "use_cache": false,
  "vocab_size": 110592
}
